Public Member Functions | List of all members
ACAPI::ZoneBoundaryQuery::Modifier Class Reference
Element Manager
Modifier of the ZoneBoundaryQuery. More...
#include <ZoneBoundaryQuery.hpp>
 Inheritance diagram for ACAPI::ZoneBoundaryQuery::Modifier:
 Public Member Functions
Result< void >  | Update (GS::ProcessControl &)
Updates the boundaries of the Zones in the current view. Works only on Floor Plan window and 3D Model window.
Detailed Description
Modifier of the ZoneBoundaryQuery.
Member Function Documentation
◆ Update()
 Result< void > ACAPI::ZoneBoundaryQuery::Modifier::Update  |  ( |  GS::ProcessControl & |   | )
nodiscard
Updates the boundaries of the Zones in the current view. Works only on Floor Plan window and 3D Model window.
Returns
Returns an error if the current window is not Floor Plan or 3D Model.